docs/quantum-computing.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-09-10 Thu 18:56 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wojciech Gac" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>

</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga845a42">Quantum Computing - Conceptual Introduction</a>
<ul>
<li><a href="#orgc7b2d8c">Preliminaries - What Is QC?</a>
<ul>
<li><a href="#org9c4abdf">Building Blocks</a></li>
<li><a href="#orgd6bfca8">Mathematics of QC</a></li>
<li><a href="#orgcd31a54">Examples of Quantum Circuits</a></li>
</ul>
</li>
<li><a href="#org0a77bb7">Useful Resources</a>
<ul>
<li><a href="#org42adf79">Quantum Programming Languages</a></li>
<li><a href="#orgd07599c">Circuit Visualization</a></li>
<li><a href="#orgb5bf774">Blogs</a></li>
<li><a href="#org1597534">Books &amp; Lecture Notes</a></li>
<li><a href="#org8fa7bc5">Podcasts</a></li>
<li><a href="#org571b3c0">Miscellaneous</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orga845a42" class="outline-2">
<h2 id="orga845a42">Quantum Computing - Conceptual Introduction</h2>
<div class="outline-text-2" id="text-orga845a42">
</div>
<div id="outline-container-orgc7b2d8c" class="outline-3">
<h3 id="orgc7b2d8c">Preliminaries - What Is QC?</h3>
<div class="outline-text-3" id="text-orgc7b2d8c">
</div>
<div id="outline-container-org9c4abdf" class="outline-4">
<h4 id="org9c4abdf">Building Blocks</h4>
<div class="outline-text-4" id="text-org9c4abdf">
</div>
<ul class="org-ul">
<li><a id="orgd928294"></a>Qubits<br />
<div class="outline-text-5" id="text-orgd928294">
<ul class="org-ul">
<li>Short for <code>quantum bits</code>.</li>
<li>Just like classical bits they need a well-defined physical
representation, of which there are many (e.g. photonic
polarization, electron spin, nuclear spin, Josephson junction,
ion trap, etc.)</li>
<li>Unlike classical bits, they exist in a quantum superposition of
available basis states (more on this later)</li>
<li>On the computational level we operate on <code>logical qubits</code>,
which can comprise up to 1000 physical qubits (depending on the
quantum error correction scheme)</li>
<li>An array of qubits is typically referred to as a <code>quantum
       register</code></li>
</ul>
</div>
</li>
<li><a id="org8b74992"></a>Quantum Gates<br />
<div class="outline-text-5" id="text-org8b74992">
<ul class="org-ul">
<li>QC analogues of logic gates</li>
<li>Mathematically they are represented by <code>unitary</code> matrices (more
on this later)</li>
<li>Unlike logic gates in classical computing, they are reversible
(cf. Feynman's and Fredkin's remarks on classical
reversibility)</li>
<li>n-qubit gate is represented by a \(2^n \times 2^n\) unitary matrix
(this dimensionality results from the properties of tensor products)</li>
<li>Quantum gates can transform single or multiple qubits, conflate
several qubits with each other (quantum entanglement),
conditionalize certain actions, etc.</li>
</ul>
</div>
</li>
<li><a id="orgbbc4b6e"></a>Measurement<br />
<div class="outline-text-5" id="text-orgbbc4b6e">
<ul class="org-ul">
<li>Irreversible operation on a qubit or quantum register</li>
<li>Measurements are performed relative to a basis of base vectors</li>
<li>Measurement can only yield one of the constituent <code>pure states</code>
(i.e. in the case of an already pure state the result will be
known in advance)</li>
<li>The probability of arriving at a pure state is proportional to
the squared modulus of its (complex) amplitude (more on this
later)</li>
</ul>
</div>
</li>
<li><a id="orgde70dee"></a>Ancillary qubits<br />
<div class="outline-text-5" id="text-orgde70dee">
<ul class="org-ul">
<li>Because reversibility sometimes requires outputting additional
information, it may be necessary to use additional, so called
<code>ancillary</code> qubits, which will store this information and can
later be discarded.</li>
<li>Because sometimes the ancillary qubits get entangled with the
main thread of computation, it is not always possible to just
discard them. In such cases one might need to perform
<code>uncomputation</code>, which is a unitary way to <code>undo</code> the
entanglement.</li>
</ul>
</div>
</li>
<li><a id="org5ab7764"></a>Decoherence<br />
<div class="outline-text-5" id="text-org5ab7764">
<ul class="org-ul">
<li>Unwanted, but unavoidable (?) interference between
computational elements (qubits) and their (quantum-mechanical)
surroundings</li>
<li>Decoherence boils down to physical qubits getting entangled
with the environment</li>
<li>Attempts to limit decoherence involve cryogenic environments,
shielding, quantum error correction, etc.</li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-orgd6bfca8" class="outline-4">
<h4 id="orgd6bfca8">Mathematics of QC</h4>
<div class="outline-text-4" id="text-orgd6bfca8">
</div>
<ul class="org-ul">
<li><a id="orgba7cde6"></a>Basic postulates of Quantum Mechanics<br /></li>
<li><a id="org8d8fbb1"></a>Mathematical concepts<br />
<ul class="org-ul">
<li><a id="org56ce7df"></a>Ket (vector)<br />
<div class="outline-text-6" id="text-org56ce7df">
<ul class="org-ul">
<li>An ordinary vector can be represented sybolically as a <code>ket</code>
(after Dirac)</li>
<li>Notational equivalence:</li>
</ul>
<p>
\[|a\rangle \equiv \begin{bmatrix}
      a_1\\
      a_2\\
      \vdots\\
      a_n\\
      \end{bmatrix}
      \]
</p>
</div>
</li>
<li><a id="orgaea73ba"></a>Bra (covector)<br />
<div class="outline-text-6" id="text-orgaea73ba">
<ul class="org-ul">
<li>An object dual to a vector (a <code>covector</code> or <code>form</code>) can be
represented sybolically as a <code>bra</code></li>
<li>Hermitian conjugate is the conversion operation between bras
and kets</li>
<li>Notational equivalence:</li>
</ul>
<p>
\[\langle a| \equiv {|a\rangle}^\dagger \equiv \begin{bmatrix}
      a_1\\
      a_2\\
      \vdots\\
      a_n\\
      \end{bmatrix}^\dagger \equiv \begin{bmatrix} a_1^* & a_2^* & \cdots & a_n^*\end{bmatrix}
      \]
</p>
</div>
</li>
<li><a id="orgccbe051"></a>Hermitian adjoint (or conjugate)<br />
<div class="outline-text-6" id="text-orgccbe051">
<ul class="org-ul">
<li>A combination of matrix transposition and taking complex
conjugates of all its elements: \(A^\dagger = (A^T)^* =
        (A^*)^T\)</li>
</ul>
</div>
</li>
<li><a id="org3f1a262"></a>Unitarity<br />
<div class="outline-text-6" id="text-org3f1a262">
<ul class="org-ul">
<li>A matrix is unitary when \(AA^\dagger = A^\dagger A = I\)</li>
<li>Unitary matrices preserve vector lengths and are thus
generalizations of rotations \(\langle a A|A a\rangle = \langle
        a|A^\dagger A|a\rangle = \langle a|I|a\rangle = \langle
        a|a\rangle\)</li>
<li>All quantum gates satisfy this property</li>
<li>Unitary matrices have eigenvalues of modulus \(1\) (shown <a href="https://math.stackexchange.com/questions/1717713/show-that-the-eigenvalues-of-a-unitary-matrix-have-modulus-1">here</a>)</li>
</ul>
</div>
</li>
<li><a id="org97f9426"></a>Hermiticity (self-adjointedness)<br />
<div class="outline-text-6" id="text-org97f9426">
<ul class="org-ul">
<li>A Hermitian (self-adjoint) matrix is identical to its
Hermitian conjugate</li>
<li>All eigenvalues of a Hermitian matrix are real</li>
<li>Because of the above, physical observables (i.e. measurable
properties of a system) are represented as Hermitian operators</li>
</ul>
</div>
</li>
</ul>
</li>
</ul>
</div>
<div id="outline-container-orgcd31a54" class="outline-4">
<h4 id="orgcd31a54">Examples of Quantum Circuits</h4>
<div class="outline-text-4" id="text-orgcd31a54">
</div>
<ul class="org-ul">
<li><a id="orgff18591"></a><a href="https://algassert.com/quirk#circuit=%7B%22cols%22:%5B%5B%22X%22,%22X%22%5D%5D,%22init%22:%5B0,1%5D%7D">NOT gate</a><br />
<div class="outline-text-5" id="text-orgff18591">
<p>
Acting on two separate qubits set to \(|0\rangle\) and \(|1\rangle\)
respectively.
</p>
</div>
</li>
<li><a id="org79a18d9"></a><a href="https://algassert.com/quirk#circuit=%7B%22cols%22:%5B%5B%22H%22%5D%5D%7D">Hadamard gate</a><br />
<div class="outline-text-5" id="text-org79a18d9">
<p>
Converting a pure state into a superposition
</p>
</div>
</li>
<li><a id="orgb060bd9"></a><a href="https://algassert.com/quirk#circuit=%7B%22cols%22:%5B%5B%22H%22%5D,%5B%22H%22%5D%5D%7D">2 Hadamard gates</a><br />
<div class="outline-text-5" id="text-orgb060bd9">
<p>
&#x2026; and back again
</p>
</div>
</li>
<li><a id="org4c5efa5"></a><a href="https://algassert.com/quirk#circuit=%7B%22cols%22:%5B%5B%22%E2%80%A2%22,%22X%22%5D%5D%7D">CNOT gate</a><br />
<div class="outline-text-5" id="text-org4c5efa5">
<p>
Controlled NOT
</p>
</div>
</li>
<li><a id="org91f8e45"></a><a href="https://algassert.com/quirk#circuit=%7B%22cols%22:%5B%5B%22H%22%5D,%5B%22%E2%80%A2%22,%22X%22%5D%5D%7D">Bell state</a><br />
<div class="outline-text-5" id="text-org91f8e45">
<p>
Simplest instance of quantum entanglement
</p>
</div>
</li>
<li><a id="org6b619a4"></a><a href="https://algassert.com/quirk#circuit=%7B%22cols%22:%5B%5B%22Swap%22,%22Swap%22%5D%5D,%22init%22:%5B0,1%5D%7D">SWAP gate</a><br />
<div class="outline-text-5" id="text-org6b619a4">
<p>
Exchange two qubits connected by the gate
</p>
</div>
</li>
<li><a id="orgd9228dd"></a><a href="https://algassert.com/quirk#circuit=%7B%22cols%22:%5B%5B%22Z%22,%22Z%22%5D%5D,%22init%22:%5B0,1%5D%7D">Z gate</a><br />
<div class="outline-text-5" id="text-orgd9228dd">
<p>
Negates the \(|1\rangle\) state
</p>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-org0a77bb7" class="outline-3">
<h3 id="org0a77bb7">Useful Resources</h3>
<div class="outline-text-3" id="text-org0a77bb7">
</div>
<div id="outline-container-org42adf79" class="outline-4">
<h4 id="org42adf79">Quantum Programming Languages</h4>
<div class="outline-text-4" id="text-org42adf79">
</div>
<ul class="org-ul">
<li><a id="org04acb85"></a><a href="https://docs.microsoft.com/en-us/quantum/">Q# and Quantum Development Kit</a><br />
<div class="outline-text-5" id="text-org04acb85">
<p>
QPL designed by Microsoft. The QDK contains a quantum simulator
and many useful debugging tools. Q# programs are embedded within
C# code, which handles the non-quantum part.
</p>
</div>
</li>
<li><a id="orge838338"></a><a href="https://qiskit.org/">Qiskit</a><br />
<div class="outline-text-5" id="text-orge838338">
<p>
QPL by IBM. Reasonably mature programming environment, heavy
integration with Jupyter notebooks, lots of high-quality
introductory material.
</p>
</div>
</li>
<li><a id="org6eb7895"></a><a href="https://pyquil-docs.rigetti.com/en/stable/">PyQuil and Forest SDK</a><br />
<div class="outline-text-5" id="text-org6eb7895">
<p>
QPL build by Rigetti Computing. Embeds quantum computations
within ordinary Python code. Unlike Q# it's more of a library
than separate language. Facilitates experiments with 
</p>
</div>
</li>
<li><a id="org61530a7"></a><a href="https://www.mathstat.dal.ca/~selinger/quipper/">Quipper</a><br />
<div class="outline-text-5" id="text-org61530a7">
<p>
A QPL embedded in Haskell. Aspects of quantum computation, such
as measurement, are represented as monadic types (cf. our
conversation at Luigi's Lucky Leprechaun)
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-orgd07599c" class="outline-4">
<h4 id="orgd07599c">Circuit Visualization</h4>
<div class="outline-text-4" id="text-orgd07599c">
</div>
<ul class="org-ul">
<li><a id="org6f54dce"></a><a href="https://algassert.com/quirk">Quirk</a><br />
<div class="outline-text-5" id="text-org6f54dce">
<p>
Simple and intuitive quantum circuit visualizer. Good to untangle
(hehe&#x2026;) conceptual confusion that sometimes arises when working
on a problem.
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-orgb5bf774" class="outline-4">
<h4 id="orgb5bf774">Blogs</h4>
<div class="outline-text-4" id="text-orgb5bf774">
</div>
<ul class="org-ul">
<li><a id="org3839aae"></a><a href="https://www.scottaaronson.com/blog/">Shtetl-Optimized</a><br />
<div class="outline-text-5" id="text-org3839aae">
<p>
Scientific blog by Scott Aaronson. Lots of explanations,
discussions and pointers to other resources.
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-org1597534" class="outline-4">
<h4 id="org1597534">Books &amp; Lecture Notes</h4>
<div class="outline-text-4" id="text-org1597534">
</div>
<ul class="org-ul">
<li><a id="org47e30e3"></a><a href="https://www.cambridge.org/pl/academic/subjects/physics/quantum-physics-quantum-information-and-quantum-computation/quantum-computation-and-quantum-information-10th-anniversary-edition?format=HB&amp;isbn=9781107002173">Michael Nielsen, Isaac Chuang - Quantum Computation and Quantum Information</a><br />
<div class="outline-text-5" id="text-org47e30e3">
<p>
In-depth introduction to QC concepts and discussion of physical
implementations.
</p>
</div>
</li>
<li><a id="orgcdcf86b"></a><a href="https://www.amazon.com/Quantum-Computing-since-Democritus-Aaronson/dp/0521199565">Scott Aaronson - Quantum Computing Since Democritus</a><br />
<div class="outline-text-5" id="text-orgcdcf86b">
<p>
Slightly humorous and heavily philosophical take on QC and
complexity theory.
</p>
</div>
</li>
<li><a id="org420dc60"></a><a href="https://www.springer.com/gp/book/9783030239213">Jack Hidary - Quantum Computing: An Applied Approach</a><br />
<div class="outline-text-5" id="text-org420dc60">
<p>
Slightly more accessible than "Mike &amp; Ike". Not as in-depth.
</p>
</div>
</li>
<li><a id="org86f1715"></a><a href="http://theory.caltech.edu/~preskill/ph229/">John Preskill - Lecture Notes for Phys 219/CS 219 - Quantum Computation</a><br />
<div class="outline-text-5" id="text-org86f1715">
<p>
Well-written, but technical introduction to the topic.
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-org8fa7bc5" class="outline-4">
<h4 id="org8fa7bc5">Podcasts</h4>
<div class="outline-text-4" id="text-org8fa7bc5">
</div>
<ul class="org-ul">
<li><a id="org3c05500"></a><a href="https://lexfridman.com/scott-aaronson/">Lex Fridman - Scott Aaronson</a><br /></li>
<li><a id="orgf4250e7"></a><a href="https://lexfridman.com/leonard-susskind/">Lex Fridman - Leonard Susskind</a><br /></li>
<li><a id="org0ab2ad1"></a><a href="https://blog.ycombinator.com/john-preskill-on-quantum-computing/">Y Combinator Podcast - John Preskill</a><br /></li>
<li><a id="orgde8c31f"></a><a href="https://blog.ycombinator.com/scott-aaronson-on-computational-complexity-theory-and-quantum-computers/">Y Combinator Podcast - Scott Aaronson</a><br /></li>
<li><a id="org670de94"></a><a href="https://blog.ycombinator.com/leonard-susskind-on-richard-feynman-the-holographic-principle-and-unanswered-questions-in-physics/">Y Combinator Podcast - Leonard Susskind</a><br /></li>
<li><a id="org8ac0e45"></a><a href="https://blog.ycombinator.com/simon-benjamin-on-architectures-for-quantum-computing/">Y Combinator Podcast - Simon Benjamin</a><br />
<div class="outline-text-5" id="text-org8ac0e45">
<p>
Discussion of various types of QC architectures
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-org571b3c0" class="outline-4">
<h4 id="org571b3c0">Miscellaneous</h4>
<div class="outline-text-4" id="text-org571b3c0">
</div>
<ul class="org-ul">
<li><a id="org4aca6b0"></a><a href="https://quantumkoans.com/">Quantum Koans</a><br />
<div class="outline-text-5" id="text-org4aca6b0">
<p>
Half-tongue-in-cheek, half-serious musings on the nature of QM
</p>
</div>
</li>
<li><a id="org3007aa0"></a><a href="https://github.com/microsoft/QuantumKatas">Microsoft Quantum Katas</a><br />
<div class="outline-text-5" id="text-org3007aa0">
<p>
A koan-like approach to teaching QC and Q#
</p>
</div>
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Wojciech Gac</p>
<p class="date">Created: 2020-09-10 Thu 18:56</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
